using System;

/// <summary>
//      Написать программу «Группа студентов».
//          Программа получает следующие данные:
//               ▷▷список студентов группы,
//               ▷▷список предметов для группы,
//               ▷▷таблицу оценок студентов группы по всем предметам.
//          Программа выводит следующие данные:
//               ▷▷таблицу оценок студентов по предметам,
//               ▷▷средние оценки студентов,
//               ▷▷средние оценки по предметам,
//               ▷▷средний балл группы,
//               ▷▷максимальные и минимальные оценки по предметам с указанием студентов.
//      Разработать и использовать в программе классы:
//      «Группа», «Студент», «Предмет».
//      Атрибуты группы: название, список студентов, список предметов.
//      Атрибуты студента: имя, список
//      Атрибуты предмета: название
/// </summary>


namespace Group_of_students
{
    class Program
    {
        static void Main()
        {
            
        }
    }
}